artillery-tests/reports/house-no-caching-30get.txt
--------------------------------
Summary report @ 16:00:08(+0000)
--------------------------------

http.codes.200: ................................................................ 3040
http.codes.201: ................................................................ 190
http.codes.204: ................................................................ 95
http.downloaded_bytes: ......................................................... 558600
http.request_rate: ............................................................. 84/sec
http.requests: ................................................................. 3325
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5043
  median: ...................................................................... 478.3
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 2725
http.responses: ................................................................ 3325
plugins.metrics-by-endpoint.DELETE /house/:houseID.codes.204: .................. 95
plugins.metrics-by-endpoint.DELETE /user/:userID.codes.200: .................... 95
plugins.metrics-by-endpoint.GET /house/:houseID.codes.200: ..................... 2850
plugins.metrics-by-endpoint.POST /house.codes.201: ............................. 95
plugins.metrics-by-endpoint.POST /user.codes.201: .............................. 95
plugins.metrics-by-endpoint.POST /user/auth.codes.200: ......................... 95
plugins.metrics-by-endpoint.response_time.DELETE /house/:houseID:
  min: ......................................................................... 79
  max: ......................................................................... 2103
  median: ...................................................................... 671.9
  p95: ......................................................................... 1686.1
  p99: ......................................................................... 2018.7
plugins.metrics-by-endpoint.response_time.DELETE /user/:userID:
  min: ......................................................................... 90
  max: ......................................................................... 1902
  median: ...................................................................... 478.3
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1556.5
plugins.metrics-by-endpoint.response_time.GET /house/:houseID:
  min: ......................................................................... 0
  max: ......................................................................... 5043
  median: ...................................................................... 478.3
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 2143.5
plugins.metrics-by-endpoint.response_time.POST /house:
  min: ......................................................................... 72
  max: ......................................................................... 3158
  median: ...................................................................... 487.9
  p95: ......................................................................... 3072.4
  p99: ......................................................................... 3134.5
plugins.metrics-by-endpoint.response_time.POST /user:
  min: ......................................................................... 34
  max: ......................................................................... 3312
  median: ...................................................................... 308
  p95: ......................................................................... 2725
  p99: ......................................................................... 3262.4
plugins.metrics-by-endpoint.response_time.POST /user/auth:
  min: ......................................................................... 52
  max: ......................................................................... 3473
  median: ...................................................................... 232.8
  p95: ......................................................................... 1380.5
  p99: ......................................................................... 3464.1
vusers.completed: .............................................................. 95
vusers.created: ................................................................ 95
vusers.created_by_name.House Flow: ............................................. 95
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 14156.1
  max: ......................................................................... 28833.7
  median: ...................................................................... 19737.6
  p95: ......................................................................... 25598.5
  p99: ......................................................................... 27181.5